---
kind: method
id: M:Autodesk.Revit.DB.ContourSettingItem.Dispose
source: html/882ac95f-349a-8e04-2414-172e876c6e88.htm
---
# Autodesk.Revit.DB.ContourSettingItem.Dispose Method

Releases all resources used by the ContourSettingItem

## Syntax (C#)
```csharp
public void Dispose()
```